# Tips and Trick Python Pandas 13 !

# Konversi Nilai Numerik ke dalam Kategori pada Data Frame

# Import Module

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Buat Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), columns=cols)

df

   usia
0    45
1    12
2    14
3    65
4    71
5    19
6    68
7    68
8    21
9    71

# Pengelompokan nilai kedalam beberapa kategori dengan `cut()`

menggunakan `bins` sebagai pembatas cut

In [3]:
df['kelompok_usia '] = pd.cut(df['usia'],
                             bins = [0, 18, 65, 99],
                             labels = ['anak','dewasa','manula'])
df

   usia kelompok_usia
0    45         dewasa
1    12           anak
2    14           anak
3    65         dewasa
4    71         manula
5    19         dewasa
6    68         manula
7    68         manula
8    21         dewasa
9    71         manula